IDENTIFICATION DIVISION.
PROGRAM-ID. Challenge.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT NAME-FILE
        ASSIGN TO INFILE
        ORGANIZATION IS LINE SEQUENTIAL
        ACCESS IS SEQUENTIAL
	.

DATA DIVISION.
FILE SECTION.
    FD NAME-FILE.
        01 NAME.
            05 FIRSTNAME PIC X(25).
*>            05 FILLER PIC A.
            05 LASTNAME PIC X(25).

WORKING-STORAGE SECTION.
    01 FORMATTED-INTEGER PIC Z(04)9.
    01 COMMANDLINE PIC X(255).
    01 INFILE PIC X(255) VALUE '../../testfile_v2.txt'.
    01 MAXRECORDS PIC 9(4) VALUE 0.
    01 RECORDSPROCESSED PIC 9(4) VALUE 0.
    01 ARGC PIC 999.
    01 EOFINDICATOR PIC X.
        88 EOF VALUE 'Y'.
    01 FNISPALINDROME PIC X(3) JUSTIFIED RIGHT.
        88 YOUBETCHA VALUE 'YES'.
        88 NOWAYJOSE VALUE 'NO'.
    01 LNISPALINDROME PIC X(3).
        88 YOUBETCHA VALUE 'YES'.
        88 NOWAYJOSE VALUE 'NO'.

PROCEDURE DIVISION.
MAIN.
    PERFORM CHECK-ARGUMENTS
    OPEN INPUT NAME-FILE
    PERFORM READ-NAME UNTIL EOF OR ((NOT MAXRECORDS = 0) AND RECORDSPROCESSED >= MAXRECORDS)
    CLOSE NAME-FILE
*>    MOVE RECORDSPROCESSED TO FORMATTED-INTEGER
*>    DISPLAY "Records Processed: " FUNCTION TRIM(FORMATTED-INTEGER)
    STOP RUN.
    
CHECK-ARGUMENTS.
    ACCEPT ARGC FROM ARGUMENT-NUMBER
*>    ACCEPT COMMANDLINE FROM COMMAND-LINE
*>    DISPLAY "Command line arguments: " FUNCTION TRIM(COMMANDLINE)
*>    DISPLAY "Number of arguments: " ARGC
    IF ARGC > 0 THEN
        ACCEPT INFILE FROM ARGUMENT-VALUE

        IF ARGC > 1 THEN
            ACCEPT MAXRECORDS FROM ARGUMENT-VALUE
	END-IF
    END-IF
*>    DISPLAY "Input file: " FUNCTION TRIM(INFILE)
    MOVE MAXRECORDS TO FORMATTED-INTEGER
*>    DISPLAY "Record Count: " FUNCTION TRIM(FORMATTED-INTEGER)
    .
    
READ-NAME.
    READ NAME-FILE
       AT END
          SET EOF TO TRUE
       NOT AT END
           CALL 'PALINDROMECHECK' USING FIRSTNAME, FNISPALINDROME
           CALL 'PALINDROMECHECK' USING LASTNAME, LNISPALINDROME
   	   DISPLAY FNISPALINDROME " " FIRSTNAME " " LNISPALINDROME " " LASTNAME
	   ADD 1 TO RECORDSPROCESSED
    END-READ
    .

END PROGRAM Challenge.
